app/views/recipes/show.html.erb

SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."recipe_id" = 5
---
<ul>
<% @recipe.ingredients.each do |i| %>