app/views/kitchens/show.html.erb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."kitchen_id" = 2
---
<ul>
<% @kitchen.recipes.each do |r| %>