app/controllers/ingredients_controller.rb

SELECT "ingredients".* FROM "ingredients"
---
  def index
      @kitchen = Kitchen.find(params[:kitchen_id])
    @recipe = Recipe.find(params[:recipe_id])
    @ingredients = Ingredient.all

SELECT "kitchens".* FROM "kitchens" WHERE "kitchens"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
      @kitchen = Kitchen.find(params[:kitchen_id])
    @recipe = Recipe.find(params[:recipe_id])
    @ingredient = Ingredient.find(params[:id])

SELECT "kitchens".* FROM "kitchens" WHERE "kitchens"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT 1  [["id", "1"]]
---
  def new
    @ingredient = Ingredient.new
    @kitchen = Kitchen.find(params[:kitchen_id])
    @recipe = Recipe.find(params[:recipe_id])

SELECT "kitchens".* FROM "kitchens" WHERE "kitchens"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT 1  [["id", "4"]]
---
  def edit
      @kitchen = Kitchen.find(params[:kitchen_id])
    @recipe = Recipe.find(params[:recipe_id])
    @ingredient = Ingredient.find(params[:id])

SELECT "kitchens".* FROM "kitchens" WHERE "kitchens"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "ingredients" ("amount", "created_at", "name", "recipe_id", "unit", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["amount", nil], ["created_at", Wed, 14 Nov 2012 20:06:58 UTC +00:00], ["name", "flour"], ["recipe_id", nil], ["unit", ""], ["updated_at", Wed, 14 Nov 2012 20:06:58 UTC +00:00]]
---
  def create
      @kitchen = Kitchen.find(params[:kitchen_id])
    @recipe = Recipe.find(params[:recipe_id])
    @ingredient = Ingredient.new(params[:ingredient])

    @ingredient.recipe_id = @recipe.id

    respond_to do |format|
      if @ingredient.save

SELECT "kitchens".* FROM "kitchens" WHERE "kitchens"."id" = ? LIMIT 1  [["id", "5"]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT 1  [["id", "6"]]
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "ingredients" SET "amount" = 0, "updated_at" = '2012-11-11 04:42:08.492425' WHERE "ingredients"."id" = 4
---
  def update
      @kitchen = Kitchen.find(params[:kitchen_id])
    @recipe = Recipe.find(params[:recipe_id])
    @ingredient = Ingredient.find(params[:id])

    respond_to do |format|
      if @ingredient.update_attributes(params[:ingredient])