app/controllers/recipes_controller.rb

  def show
  	@kitchen = Kitchen.find(params[:kitchen_id])
    @recipe = Recipe.find(params[:id])
---
SELECT "kitchens".* FROM "kitchens" WHERE "kitchens"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT 1  [["id", "1"]]

  def new
  	@kitchen = Kitchen.find(params[:kitchen_id])
---
SELECT "kitchens".* FROM "kitchens" WHERE "kitchens"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
  	@kitchen = Kitchen.find(params[:kitchen_id])
    @recipe = Recipe.find(params[:id])
---
SELECT "kitchens".* FROM "kitchens" WHERE "kitchens"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT 1  [["id", "1"]]

  def create
  	@kitchen = Kitchen.find(params[:kitchen_id])
    @recipe = Recipe.new(params[:recipe])
    @recipe.kitchen_id = @kitchen.id

    respond_to do |format|
      if @recipe.save
---
SELECT "kitchens".* FROM "kitchens" WHERE "kitchens"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "recipes" ("created_at", "kitchen_id", "name", "photo", "rating", "serves", "steps", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @kitchen = Kitchen.find(params[:kitchen_id])
    @recipe = Recipe.find(params[:id])

    respond_to do |format|
      if @recipe.update_attributes(params[:recipe])
---
SELECT "kitchens".* FROM "kitchens" WHERE "kitchens"."id" = ? LIMIT 1  [["id", "5"]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT 1  [["id", "6"]]
UPDATE "recipes" SET "steps" = 'bake and frost', "photo" = 'cupcake.jpg', "updated_at" = '2012-11-14 23:42:49.689881' WHERE "recipes"."id" = 1

  def destroy
    @kitchen = Kitchen.find(params[:kitchen_id])
    @recipe = Recipe.find(params[:id])
    @recipe.destroy
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "recipes" WHERE "recipes"."id" = ?  [["id", 1]]